[Killed] BlockStatement
src/services/bankAccount.service.ts:5:71
 
 export class BankAccountService implements IBankAccountService {
 
-    async createAccount(initialBalance: number): Promise<BankAccount> {
-        this.validateInitialBalance(initialBalance);
-        return {
-            balance: initialBalance,
-            movements: initialBalance > 0 
-            ? [{type: 'deposit', amount: initialBalance,date: new Date()}] 
-            : []
-        };
-    }
+    async createAccount(initialBalance: number): Promise<BankAccount> {}
 
     async deposit(account: BankAccount, amount: number): Promise<BankAccount> {
killedBy: BankAccountService should create account with initial balance 0
statusReason: Cannot read properties of undefined (reading 'balance')

[Killed] ConditionalExpression
src/services/bankAccount.service.ts:9:24
         this.validateInitialBalance(initialBalance);
         return {
             balance: initialBalance,
-            movements: initialBalance > 0 
+            movements: false 
             ? [{type: 'deposit', amount: initialBalance,date: new Date()}] 
             : []
killedBy: BankAccountService should create account with initial balance
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/services/bankAccount.service.ts:9:24
         this.validateInitialBalance(initialBalance);
         return {
             balance: initialBalance,
-            movements: initialBalance > 0 
+            movements: true 
             ? [{type: 'deposit', amount: initialBalance,date: new Date()}] 
             : []
killedBy: BankAccountService should create account with initial balance 0
statusReason: expected 1 to be +0 // Object.is equality

[Killed] ArrayDeclaration
src/services/bankAccount.service.ts:10:15
         return {
             balance: initialBalance,
             movements: initialBalance > 0 
-            ? [{type: 'deposit', amount: initialBalance,date: new Date()}] 
+            ? [] 
             : []
         };
killedBy: BankAccountService should create account with initial balance
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ArrayDeclaration
src/services/bankAccount.service.ts:11:15
             balance: initialBalance,
             movements: initialBalance > 0 
             ? [{type: 'deposit', amount: initialBalance,date: new Date()}] 
-            : []
+            : ["Stryker was here"]
         };
     }
killedBy: BankAccountService should create account with initial balance 0
statusReason: expected 1 to be +0 // Object.is equality

[Killed] BlockStatement
src/services/bankAccount.service.ts:15:79
         };
     }
 
-    async deposit(account: BankAccount, amount: number): Promise<BankAccount> {
-        this.validateAmount(amount);
-        account.balance += amount;
-        account.movements.push(this.addMovement(account, 'deposit', amount));
-        return account;
-    }
+    async deposit(account: BankAccount, amount: number): Promise<BankAccount> {}
 
     async withdraw(account: BankAccount, amount: number): Promise<BankAccount> {
killedBy: BankAccountService should store the movements correctly
statusReason: expected [ { type: 'deposit', …(2) }, …(1) ] to have a length of 3 but got 2

[Killed] AssignmentOperator
src/services/bankAccount.service.ts:17:9
 
     async deposit(account: BankAccount, amount: number): Promise<BankAccount> {
         this.validateAmount(amount);
-        account.balance += amount;
+        account.balance -= amount;
         account.movements.push(this.addMovement(account, 'deposit', amount));
         return account;
killedBy: BankAccountService should return the updated balance after several movements
statusReason: expected 2200 to be 4200 // Object.is equality

[Killed] BlockStatement
src/services/bankAccount.service.ts:22:80
         return account;
     }
 
-    async withdraw(account: BankAccount, amount: number): Promise<BankAccount> {
-        this.validateAmount(amount);
-        this.validateSufficientFunds(account, amount);
-        account.balance -= amount;
-        account.movements.push(this.addMovement(account, 'withdrawal', amount));
-        return account;
-    }
+    async withdraw(account: BankAccount, amount: number): Promise<BankAccount> {}
 
     getBalance(account: BankAccount): number { //
killedBy: BankAccountService should store the movements correctly
statusReason: expected [ { type: 'deposit', …(2) }, …(1) ] to have a length of 3 but got 2

[Killed] AssignmentOperator
src/services/bankAccount.service.ts:25:9
     async withdraw(account: BankAccount, amount: number): Promise<BankAccount> {
         this.validateAmount(amount);
         this.validateSufficientFunds(account, amount);
-        account.balance -= amount;
+        account.balance += amount;
         account.movements.push(this.addMovement(account, 'withdrawal', amount));
         return account;
killedBy: BankAccountService should return the updated balance after several movements
statusReason: expected 8200 to be 4200 // Object.is equality

[Killed] BlockStatement
src/services/bankAccount.service.ts:30:46
         return account;
     }
 
-    getBalance(account: BankAccount): number { //
-        return account.balance;
-    }
+    getBalance(account: BankAccount): number {}
 
     getMovements(account: BankAccount): Movements[] { //
killedBy: BankAccountService should return the updated balance after several movements
statusReason: expected undefined to be 4200 // Object.is equality

[Killed] BlockStatement
src/services/bankAccount.service.ts:34:53
         return account.balance;
     }
 
-    getMovements(account: BankAccount): Movements[] { //
-        return account.movements;
-    }
+    getMovements(account: BankAccount): Movements[] {}
 
     //Validators 
killedBy: BankAccountService should store the movements correctly
statusReason: Target cannot be null or undefined.

[Killed] BlockStatement
src/services/bankAccount.service.ts:39:66
     }
 
     //Validators 
-    private validateInitialBalance(initialBalance: number): void {
-        if (initialBalance < 0) {
-            throw new Error("Initial balance cannot be negative");
-        }
-    }
+    private validateInitialBalance(initialBalance: number): void {}
 
     private validateAmount(amount: number): void {
killedBy: BankAccountService should throw an error if initial balance is negative
statusReason: promise resolved "{ balance: -1000, movements: [] }" instead of rejecting

[Killed] ConditionalExpression
src/services/bankAccount.service.ts:40:13
 
     //Validators 
     private validateInitialBalance(initialBalance: number): void {
-        if (initialBalance < 0) {
+        if (true) {
             throw new Error("Initial balance cannot be negative");
         }
killedBy: BankAccountService should create account with initial balance 0
statusReason: Initial balance cannot be negative

[Killed] ConditionalExpression
src/services/bankAccount.service.ts:40:13
 
     //Validators 
     private validateInitialBalance(initialBalance: number): void {
-        if (initialBalance < 0) {
+        if (false) {
             throw new Error("Initial balance cannot be negative");
         }
killedBy: BankAccountService should throw an error if initial balance is negative
statusReason: promise resolved "{ balance: -1000, movements: [] }" instead of rejecting

[Killed] BlockStatement
src/services/bankAccount.service.ts:45:50
         }
     }
 
-    private validateAmount(amount: number): void {
-        if (amount <= 0) {
-            throw new Error("Amount must be greater than 0");
-        }
-    }
+    private validateAmount(amount: number): void {}
 
     private addMovement(account: BankAccount, type: 'deposit' | 'withdrawal', amount: number): Movements { //
killedBy: BankAccountService should throw an error if deposit amount is less than or equal to 0
statusReason: promise resolved "{ balance: 7500, movements: [ …(2) ] }" instead of rejecting

[Killed] BlockStatement
src/services/bankAccount.service.ts:46:26
     }
 
     private validateAmount(amount: number): void {
-        if (amount <= 0) {
-            throw new Error("Amount must be greater than 0");
-        }
+        if (amount <= 0) {}
     }
 
killedBy: BankAccountService should throw an error if deposit amount is less than or equal to 0
statusReason: promise resolved "{ balance: 7500, movements: [ …(2) ] }" instead of rejecting

[Killed] ConditionalExpression
src/services/bankAccount.service.ts:46:13
     }
 
     private validateAmount(amount: number): void {
-        if (amount <= 0) {
+        if (false) {
             throw new Error("Amount must be greater than 0");
         }
killedBy: BankAccountService should throw an error if deposit amount is less than or equal to 0
statusReason: promise resolved "{ balance: 7500, movements: [ …(2) ] }" instead of rejecting

[Killed] BlockStatement
src/services/bankAccount.service.ts:51:106
         }
     }
 
-    private addMovement(account: BankAccount, type: 'deposit' | 'withdrawal', amount: number): Movements { //
-        const movement: Movements = { type, amount, date: new Date() };
-        return movement;
-    }
+    private addMovement(account: BankAccount, type: 'deposit' | 'withdrawal', amount: number): Movements {}
 
     private validateSufficientFunds(account: BankAccount, amount: number): void {
killedBy: BankAccountService should store the movements correctly
statusReason: Cannot read properties of undefined (reading 'type')

[Killed] BlockStatement
src/services/bankAccount.service.ts:56:81
         return movement;
     }
 
-    private validateSufficientFunds(account: BankAccount, amount: number): void {
-        if (account.balance <= amount) {
-            throw new Error("Insufficient balance");
-        }
-    }
+    private validateSufficientFunds(account: BankAccount, amount: number): void {}
 
 }
killedBy: BankAccountService should throw an error if more than the available balance is withdrawn.
statusReason: promise resolved "{ balance: -1, movements: [ …(2) ] }" instead of rejecting

[Killed] ConditionalExpression
src/services/bankAccount.service.ts:57:13
     }
 
     private validateSufficientFunds(account: BankAccount, amount: number): void {
-        if (account.balance <= amount) {
+        if (true) {
             throw new Error("Insufficient balance");
         }
killedBy: BankAccountService should store the movements correctly
statusReason: Insufficient balance

[Killed] BlockStatement
src/services/bankAccount.service.ts:57:40
     }
 
     private validateSufficientFunds(account: BankAccount, amount: number): void {
-        if (account.balance <= amount) {
-            throw new Error("Insufficient balance");
-        }
+        if (account.balance <= amount) {}
     }
 
killedBy: BankAccountService should throw an error if more than the available balance is withdrawn.
statusReason: promise resolved "{ balance: -1, movements: [ …(2) ] }" instead of rejecting
