[Killed] BlockStatement
src/services/employee.service.ts:5:62
 
 export class EmployeeService implements IEmployeeService {
 
-    async createEmployee(employee:Employee):Promise<Employee>{
-        this.validateEmployee(employee);
-        employee.fullName = this.generateFullName(employee);
-        return employee
-    }
+    async createEmployee(employee:Employee):Promise<Employee>{}
 
     private validateEmployee(employee: Employee): void {
killedBy: EmployeeService create employee is Estefania
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/services/employee.service.ts:11:56
         return employee
     }
 
-    private validateEmployee(employee: Employee): void {
-        this.validateName(employee.name);
-        this.validateLastName(employee.lastName);
-        this.validateAge(employee.age);
-    }
+    private validateEmployee(employee: Employee): void {}
 
     private validateName(name: string): void {
killedBy: EmployeeService should throw an error if name is empty
statusReason: promise resolved "{ name: '', lastName: 'Muñoz', …(2) }" instead of rejecting

[Killed] BlockStatement
src/services/employee.service.ts:17:46
         this.validateAge(employee.age);
     }
 
-    private validateName(name: string): void {
-        if (!name || name.trim() === "") {
-            throw new Error("Name is required");
-        }
-
-        if (name.trim().length < 3) {
-            throw new Error("Name must be at least 3 characters long");
-        }
-    }
+    private validateName(name: string): void {}
 
     private validateLastName(lastName:string) : void {
killedBy: EmployeeService should throw an error if name is empty
statusReason: promise resolved "{ name: '', lastName: 'Muñoz', …(2) }" instead of rejecting

[Killed] ConditionalExpression
src/services/employee.service.ts:18:13
     }
 
     private validateName(name: string): void {
-        if (!name || name.trim() === "") {
+        if (true) {
             throw new Error("Name is required");
         }
killedBy: EmployeeService create employee is Estefania
statusReason: Name is required

[Killed] EqualityOperator
src/services/employee.service.ts:18:22
     }
 
     private validateName(name: string): void {
-        if (!name || name.trim() === "") {
+        if (!name || name.trim() !== "") {
             throw new Error("Name is required");
         }
killedBy: EmployeeService create employee is Estefania
statusReason: Name is required

[Killed] EqualityOperator
src/services/employee.service.ts:22:13
             throw new Error("Name is required");
         }
 
-        if (name.trim().length < 3) {
+        if (name.trim().length >= 3) {
             throw new Error("Name must be at least 3 characters long");
         }
killedBy: EmployeeService create employee is Estefania
statusReason: Name must be at least 3 characters long

[Killed] BlockStatement
src/services/employee.service.ts:22:37
             throw new Error("Name is required");
         }
 
-        if (name.trim().length < 3) {
-            throw new Error("Name must be at least 3 characters long");
-        }
+        if (name.trim().length < 3) {}
     }
 
killedBy: EmployeeService should throw an error if name is less than 3 characters
statusReason: promise resolved "{ name: 'CA', lastName: 'Muñoz', …(2) }" instead of rejecting

[Killed] BlockStatement
src/services/employee.service.ts:27:54
         }
     }
 
-    private validateLastName(lastName:string) : void {
-        if(!lastName || lastName.trim() === ""){
-            throw new Error("Last name is required")
-        }
-
-        if(lastName.trim().length < 3){
-            throw new Error ("Last name must be at least 3 characters long")
-        }
-    }
+    private validateLastName(lastName:string) : void {}
 
     private validateAge(age: number): void {
killedBy: EmployeeService should throw an error if last name is empty
statusReason: promise resolved "{ name: 'Daniel', lastName: ' ', …(2) }" instead of rejecting

[Killed] BooleanLiteral
src/services/employee.service.ts:28:12
     }
 
     private validateLastName(lastName:string) : void {
-        if(!lastName || lastName.trim() === ""){
+        if(lastName || lastName.trim() === ""){
             throw new Error("Last name is required")
         }
killedBy: EmployeeService create employee is Estefania
statusReason: Last name is required

[Killed] EqualityOperator
src/services/employee.service.ts:28:25
     }
 
     private validateLastName(lastName:string) : void {
-        if(!lastName || lastName.trim() === ""){
+        if(!lastName || lastName.trim() !== ""){
             throw new Error("Last name is required")
         }
killedBy: EmployeeService create employee is Estefania
statusReason: Last name is required

[Survived] StringLiteral
src/services/employee.service.ts:29:29
 
     private validateLastName(lastName:string) : void {
         if(!lastName || lastName.trim() === ""){
-            throw new Error("Last name is required")
+            throw new Error("")
         }
 

[Killed] ConditionalExpression
src/services/employee.service.ts:32:12
             throw new Error("Last name is required")
         }
 
-        if(lastName.trim().length < 3){
+        if(true){
             throw new Error ("Last name must be at least 3 characters long")
         }
killedBy: EmployeeService create employee is Estefania
statusReason: Last name must be at least 3 characters long

[Killed] EqualityOperator
src/services/employee.service.ts:32:12
             throw new Error("Last name is required")
         }
 
-        if(lastName.trim().length < 3){
+        if(lastName.trim().length >= 3){
             throw new Error ("Last name must be at least 3 characters long")
         }
killedBy: EmployeeService create employee is Estefania
statusReason: Last name must be at least 3 characters long

[Killed] BlockStatement
src/services/employee.service.ts:37:44
         }
     }
 
-    private validateAge(age: number): void {
-        if(age < 18){ 
-            throw new Error ("Age must be at least 18")
-        }
-    }
+    private validateAge(age: number): void {}
 
     private generateFullName(employee: Employee): string {
killedBy: EmployeeService should throw an error if age is greater than 18
statusReason: promise resolved "{ name: 'Daniel', …(3) }" instead of rejecting

[Killed] EqualityOperator
src/services/employee.service.ts:38:12
     }
 
     private validateAge(age: number): void {
-        if(age < 18){ 
+        if(age <= 18){ 
             throw new Error ("Age must be at least 18")
         }
killedBy: EmployeeService create employee if age is 18
statusReason: Age must be at least 18

[Killed] EqualityOperator
src/services/employee.service.ts:38:12
     }
 
     private validateAge(age: number): void {
-        if(age < 18){ 
+        if(age >= 18){ 
             throw new Error ("Age must be at least 18")
         }
killedBy: EmployeeService create employee is Estefania
statusReason: Age must be at least 18

[Killed] BlockStatement
src/services/employee.service.ts:43:58
         }
     }
 
-    private generateFullName(employee: Employee): string {
-        return `${employee.name.trim()} ${employee.lastName.trim()}`;
-    }
+    private generateFullName(employee: Employee): string {}
 
 }
killedBy: EmployeeService should return the full name of the employee
statusReason: expected undefined to be 'Daniel Montoya' // Object.is equality

[Survived] MethodExpression
src/services/employee.service.ts:44:19
     }
 
     private generateFullName(employee: Employee): string {
-        return `${employee.name.trim()} ${employee.lastName.trim()}`;
+        return `${employee.name} ${employee.lastName.trim()}`;
     }
 

[Survived] MethodExpression
src/services/employee.service.ts:44:43
     }
 
     private generateFullName(employee: Employee): string {
-        return `${employee.name.trim()} ${employee.lastName.trim()}`;
+        return `${employee.name.trim()} ${employee.lastName}`;
     }
 
