[Killed] BlockStatement
src/services/person.service.ts:5:54
 
 export class PersonService implements IPersonService {
     
-    async createPerson(person:Person):Promise<Person>{
-        return person
-    }
+    async createPerson(person:Person):Promise<Person>{}
 }
killedBy: PersonService create person is Estefania
statusReason: expected undefined to be defined
